'''
Рефлексия по решению задач задания 10.

4. Метод, реализующий декартово произведение множеств.
Логика решения соответствует эталонной. Интересно было посмотреть, как метод можно усилить до рекурсивного.

6. Реализуйте мульти-множество (Bag), в котором каждый элемент может присутствовать несколько раз.
В целом, логика решения соответствует эталонной.


Рефлексия по решению задач задания 11.

2. Алгоритм слияния нескольких фильтров Блюма.
Сделала черещ или, как и предлагает жталонное решение7 Верно отразила увеличение ложноположительных срабатываний.

3. Фильтр Блюма, предусматривающий удаление элементов.
Сделала через счетный фильтр, но пришлось дополнительно погуглить для успешного решения.

4. Алгоритм, который анализирует конфигурацию фильтра Блюма и пытается, насколько возможно, восстановить исходное множество с учётом всех ограничений и искажений (например, коллизий, ложноположительных срабатываний...).
Сделала через брутфорс, что допускается в жталонном решении.
'''
