--14.1. Чем представление Invoices отличается от таблицы Orders?
--Представление Invoices содержит только избранные поля из этой таблицы, а также информацию о заказчике из таблицы Customers.

--14.2. Что делает представление "CategorySales for 1997"?
--Выводит сумму продаж по категориям из представления "Product Sales for 1997".

--14.3. Что делает представление "Sales Total by Amount"?
--Выводит сумму для отдельных заказов по компаниям из представсления "Order Subtotals" и таблицы Customers.

--14.4. Что делает представление "Products Above Average Price"?
--Выводит товары из таблицы Products, цена за единицу которых превышает среднее значение по таблице.

--14.5. Что делает представление "Summary of Sales by Quarter"?
--Выводит данные по заказам и их суммы их "Order Subtotals", по датам.
