/*
1. 
Решила задачу с помощью эквисоединения, а не джойна, но условия фильтрации использовала то же. Еще выбрала все поля из обеих таблиц, так как нужная информация не уточнялась.

2.
Логика решения соответствует эталонной. Только выбрала все поля из таблицы, так как нужная информация не уточнялась.

3.
Нарушила логику фильтрации приоритета, потому что не указала условие статуса задачи в ней. В остальном логика соответствует эталонной.

4.
Использовала данные только из таблицы Items, насколько понимаю, результат должен быть одинаковым. owner_id соответствует dwarf_id, и если гном владеет каким-то предметом, то его айди должен быть в таблице Items.

5.
Сделала через FULL JOIN, но результат будет одинаковым.

6.
Тут недопоняла условие и считала количество гномов в профессиях, а не задач на гномов.

7.
Логика решения соответствует эталонной.

8.
Логика решения соответствует эталонной.
*/
